tokyotheo/app/controllers/users_controller.rb

SELECT * FROM `users`
---
  def index
    @users = User.find(:all)
    # @lectures = Lecture.find(:all, :conditions => 'no < 100')
    @purchases = Purchase.find(:all, :conditions => ['user_id = ?', @current_user.user_id])
    @lectures = Lecture.find(:all)
    @lectures_finished = Array.new
    @lectures_purchased = Array.new
    @lectures_not_purchased = Array.new
    @lectures.each do |l|
      ret = nil
      @purchases.each do |pc|

SELECT * FROM `users` WHERE (`users`.`id` = 953125641)
---
  def update
    @user = User.find(params[:id])